// Выполнил задание Чучуян АБс - 424
// Вариант задания 1.d (Окружность ? длина окружности, площадь круга, площадь кругового сектора)

#include <iostream>
#include <string>

using namespace std;

void circle(){
    float r = 3;    // Значение радиуса 
    float a = 90;     // Значение угла для площади сектора в градусах 
    a = a/(57.3);     // Перевод в радианы
    float l = 3.14 * 2*r;    // Длина окружности 
    float s = 3.14 *r *r;    // Площадь круга
    float s_segment =  a/2 *r *r;    // Площадь сегмента ]

    cout << l << "  " << s << "  " << s_segment << endl;
}